Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །ཕྱོགས་བཅུ་ན་སེམས་ཅན་རབ་འབྲིང་ཐ་མ་ཐམས་ཅད་ཀྱི་སྒྲར་གྲགས་པ་དང་། སྒྲར་བཏགས་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་གསུང་དབྱངས་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་དང་ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲར་བྱིན་གྱིས་རློབ་སྟེ།
en: The bodhisattva can transform miraculously all the cries and noises—superior, mediocre, and inferior, of all living beings of the ten directions, into the voice of the Buddha, with the words of the Buddha, the Dharma, and the Saṅgha,

source: སྒྲ་དབྱངས་དེ་ལས་ཀྱང་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པའི་སྒྲ་དབྱངས་འབྱུང་བར་བྱེད་དེ།
en: having them proclaim, ‘Impermanent! Miserable! Empty! Selfless!’

source: །དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Then, the patriarch Mahākāśyapa, having heard this teaching of the inconceivable liberation of the bodhisattvas, was amazed,

source: གནས་བརྟན་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: and he said to the venerable Śāriputra,

source: །ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་མི་དམུས་ལོང་གི་མདུན་དུ་ལ་ལས་གཟུགས་སུ་གྱུར་བ་ཐམས་ཅད་བསྟན་ཀྱང་དམུས་ལོང་དེས་གཟུགས་གཅིག་ཀྱང་མི་མཐོང་བ་དེ་བཞིན་དུ།
en: Venerable Śāriputra, if one were to show a variety of things to a person blind from birth, he would not be able to see a single thing.

source: དཔེར་ན་སྲིན་བུ་མེ་ཁྱེར་གྱིས་ཉི་མའི་དཀྱིལ་འཁོར་གྱི་འོད་ཟིལ་གྱིས་མནན་པར་མི་ནུས་པ་
en: Reverend Mahākāśyapa, just as a glowworm cannot eclipse the light of the sun,

source: དེ་བཞིན་དུ་བཙུན་པ་འོད་སྲུང་གོ་སྐབས་མ་ཕྱེ་བར་བྱང་ཆུབ་སེམས་དཔའི་ཐད་དུ་འགྲོ་བའམ་བསླང་བར་མི་ནུས་སོ།
en: so, reverend Mahākāśyapa, it is not possible without special allowance that an ordinary person can thus attack and deprive a bodhisattva.

source: དཔེར་ན་བལ་གླང་གླང་པོ་ཆེ་ལ་བརྡེག་པ་ནི་བོང་བུས་བཟོད་པར་མི་ནུས་ཏེ།
en: just as a donkey could not muster an attack on a wild elephant,

source: དེ་བཞིན་དུ་བཙུན་པ་འོད་སྲུང་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན་པས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཉམ་ང་བར་བྱེད་མི་ནུས་ཀྱི་
en: even so, reverend Mahākāśyapa, one who is not himself a bodhisattva cannot harass a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཉམ་ང་བར་བྱེད་དེ།
en: Only one who is himself a bodhisattva can harass another bodhisattva, and

source: བྱང་ཆུབ་སེམས་དཔས་ཉམ་ང་བར་བྱས་པ་བྱང་ཆུབ་སེམས་དཔས་བཟོད་དོ།
en: only a bodhisattva can tolerate the harassment of another bodhisattva.

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་དེ་ནི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་ཤེས་པའི་སྟོབས་ལ་འཇུག་པའོ།
en: Reverend Mahākāśyapa, such is the introduction to the power of the knowledge of liberative art of the bodhisattvas who live in the inconceivable liberation.

source: དཔེར་ན་སྐྱེས་བུ་མཁས་པ་ཆུ་ཟླ་ལ་ལྟ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཐམས་ཅད་ལ་བལྟ་བར་བྱའོ།
en: a bodhisattva should regard all living beings as a wise man regards the reflection of the moon in water or as magicians regard men created by magic.

source: དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལ་བཞིན་ལྟ་བ་དེ་བཞིན་དུ་
en: as being like a face in a mirror;

source: སྨིག་རྒྱུའི་ཆུ་ལྟར་
en: like the water of a mirage;

source: བྲག་ཅའི་སྒྲ་སྐད་ལྟ་བུར་
en: like the sound of an echo;

source: ནམ་མཁའ་ལ་སྤྲིན་གྱི་ཕུང་པོ་ལྟ་བུར་
en: like a mass of clouds in the sky;

source: དབུ་བ་རྡོས་པའི་སྔོན་གྱི་མཐའ་ལྟ་བུར་
en: like the previous moment of a ball of foam;

source: ཆུའི་ཆུ་བུར་འབྱུང་བ་དང་འཇིག་པ་ལྟར
en: like the appearance and disappearance of a bubble of water;

source: ཆུ་ཤིང་ལ་སྙིང་པོ་ལྟ་བ་ལྟར་
en: like the core of a plantain tree;

source: གློག་གི་འཕོ་བ་ལྟར་
en: like a flash of lightning;

source: ཁམས་ལྔ་པོ་ལྟར་
en: like the fifth great element;

source: སྐྱེ་མཆེད་བདུན་པོ་ལྟར་
en: like the seventh sense-medium;

source: གཟུགས་མེད་པ་དག་ལ་གཟུགས་སུ་སྣང་བ་ལྟར་
en: like the appearance of matter in an immaterial realm;

source: ས་བོན་བརྔོས་པ་ལས་མྱུ་གུ་འགྲུབ་པ་ལྟར་
en: like a sprout from a rotten seed;

source: སྦལ་པའི་སྤུའི་གོས་ལྟར་
en: like a tortoise-hair coat;

source: ཤི་བ་འདོད་པའི་རྩེད་མོ་ལ་དགའ་བ་ལྟར་
en: like the fun of games for one who wishes to die;

source: རྒྱུན་དུ་ཞུགས་པའི་འཇིག་ཚོགས་ལ་ལྟ་བ་ལྟར་
en: like the egoistic views of a stream-winner;

source: ལན་ཅིག་ཕྱིར་འོང་བ་ལ་སྲིད་པ་གསུམ་པོ་ལྟར་
en: like a third rebirth of a once-returner;

source: ཕྱིར་མི་འོང་བ་ལ་མངལ་དུ་འཇུག་པ་ལྟར་
en: like the descent of a nonreturner into a womb;

source: དགྲ་བཅོམ་པ་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བཞིན་དུ་
en: like the existence of desire, hatred, and folly in an arhat;

source: ལ་སེར་སྣ་དང་། འཆལ་པའི་ཚུལ་ཁྲིམས་དང་། གནོད་སེམས་དང་། རྣམ་པར་འཚེ་བའི་སེམས་བཞིན་དུ་
en: like thoughts of avarice, immorality, wickedness, and hostility in a bodhisattva who has attained tolerance;

source: དེ་བཞིན་གཤེགས་པ་ལ་བག་ཆགས་བཞིན་དུ་
en: like the instincts of afflictions in a tathāgata;

source: མི་དམུས་ལོང་གིས་གཟུགས་མཐོང་བ་ལྟར་
en: like the perception of color in one blind from birth;

source: འགོག་པ་ལ་སྙོམས་པར་ཞུགས་པའི་དབུགས་འབྱུང་བ་དང་རྔུབ་པ་དེ་བཞིན་དུ་
en: like the inhalation and exhalation of an ascetic absorbed in the meditation of cessation;

source: ནམ་མཁའ་ལ་ནི་བྱའི་རྗེས་བཞིན་དུ་
en: like the track of a bird in the sky;

source: མ་ནིང་ལ་ཕོ་མཚན་སྐྱེ་བ་བཞིན་དུ་
en: like the erection of a eunuch;

source: མོ་གཤམ་གྱི་བུ་རྙེད་པ་བཞིན་དུ་
en: like the pregnancy of a barren woman;

source: དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་ཉོན་མོངས་པའི་མ་སྐྱེས་པ་དེ་བཞིན་དུ་
en: like the unproduced afflictions of an emanated incarnation of the Tathāgata;

source: རྨི་ལམ་ན་སྣང་བ་སད་ན་མཐོང་བ་བཞིན་དུ་
en: like dream-visions seen after waking;

source: ཀུན་ཏུ་མི་རྟོག་པ་ལ་ཉོན་མོངས་པ་བཞིན་དུ་
en: like the afflictions of one who is free of conceptualizations;

source: རྒྱུ་མེད་པ་ལས་མེ་འབྱུང་བ་བཞིན་དུ་
en: like fire burning without fuel;

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཉིང་མཚམས་སྦྱོར་བ་བཞིན་དུ་
en: like the reincarnation of one who has attained ultimate liberation.

source: རིགས་ཀྱི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་ཐམས་ཅད་ལ་དེ་ལྟ་བུར་སོ་སོར་བརྟག་ན་ཇི་ལྟར་ན་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་ཆེན་པོ་སྐྱེ་བར་འགྱུར།
en: Noble sir, if a bodhisattva considers all living beings in such a way, how does he generate the great love toward them?

source: འཇམ་དཔལ་ནམ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་
en: Mañjuśrī, when a bodhisattva considers all living beings in this way,

source: དེ་ལྟར་ཆོས་ཡོངས་སུ་ཤེས་ནས་སེམས་ཅན་འདི་དག་ལའང་བདག་གིས་ཆོས་བསྟན་ཏོ་སྙམ་སྟེ།
en: he thinks: ‘Just as I have realized the Dharma, so should I teach it to living beings.’

source: དེ་བས་ན་དེ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་དག་པའི་སྐྱབས་ཀྱི་བྱམས་པ་སྐྱེ་སྟེ།
en: Thereby, he generates the love that is truly a refuge for all living beings;

source: ལེན་པ་མེད་པའི་ཕྱིར་ཉེ་བར་ཞི་བའི་བྱམས་པའོ།
en: the love that is peaceful because free of grasping;

source: ཉོན་མོངས་པ་མེད་པས་གདུང་བ་མེད་པའི་བྱམས་པའོ།
en: the love that is not feverish, because free of passions;

source: །བསམ་པ་རྡོ་རྗེ་ལྟ་བུར་མི་ཕྱེད་པའི་ཕྱིར་བརྟན་པའི་བྱམས་པའོ།
en: Thereby he generates the love that is firm, its high resolve unbreakable, like a diamond;

source: །རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་ཡོངས་སུ་དག་པའི་བྱམས་པའོ།
en: the love that is pure, purified in its intrinsic nature;

source: །བསམ་པ་མཉམ་པའི་ཕྱིར་མཉམ་པའི་བྱམས་པའོ།
en: the love that is even, its aspirations being equal;

source: །རོ་མཚུངས་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་བྱམས་པའོ།
en: the love that is enlightenment because it is unity of experience;

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པའི་ཕྱིར་སྒྲོ་བཏགས་པ་མེད་པའི་བྱམས་པའོ།
en: the love that has no presumption because it has eliminated attachment and aversion;

source: དེའི་སྙིང་རྗེ་ཆེན་པོ་གང་ཡིན།
en: What is the great compassion of a bodhisattva?

source: དགེ་བའི་རྩ་བ་ཅི་བྱས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་གཏོང་བའོ།
en: It is the giving of all accumulated roots of virtue to all living beings.

source: དེའི་དགའ་བ་ཆེན་པོ་གང་ཡིན།
en: What is the great joy of a bodhisattva?

source: གང་བྱིན་ནས་ཡིད་དགའ་བར་འགྱུར་ཏེ་མི་འགྱོད་པའོ།
en: It is to be joyful and without regret in giving.

source: དེའི་བཏང་སྙོམས་གང་ཡིན།
en: What is the equanimity of a bodhisattva?

source: གང་གཉི་གའི་དོན་དུ་འགྱུར་བའོ།
en: It is what benefits both self and others.

source: འཁོར་བའི་འཇིགས་པས་སྐྲག་པ་གང་ལ་བརྟེན་པར་བྱ།
en: To what should one resort when terrified by fear of life?

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་འཇིགས་པས་སྐྲག་པ་ནི་སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་ལ་བརྟེན་པར་བྱའོ།
en: Mañjuśrī, a bodhisattva who is terrified by fear of life should resort to the magnanimity of the Buddha.

source: སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་ལ་གནས་པར་འདོད་པས་གང་ལ་གནས་པར་བྱ།
en: Where should he who wishes to resort to the magnanimity of the Buddha take his stand?

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་གནས་པར་འདོད་པས་གང་ལ་གནས་པར་བྱ།
en: Where should he who wishes to stand in equanimity toward all living beings take his stand?

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ཕྱིར་གནས་པར་བྱའོ།
en: He should live for the liberation of all living beings.

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བར་འདོད་པས་ཇི་ལྟ་བུར་བྱ།
en: What should he who wishes to liberate all living beings do?

source: ཉོན་མོངས་པ་སྤང་བར་འདོད་པས། ཇི་ལྟར་རབ་ཏུ་སྦྱར་བར་བྱ།
en: How should he who wishes to eliminate afflictions apply himself?

source: འཇམ་དཔལ་གང་རྟེན་མེད་པ་དེའི་རྩ་བར་འགྱུར་བ་ཅི་ཞིག་ཡོད་དེ།
en: Mañjuśrī, when something is baseless, how can it have any root?

source: རྟེན་མེད་པའི་རྩ་བ་གང་།
en: What is the root of baselessness?

source: རྟེན་མེད་པའོ།
en: Baselessness.

source: ཕྱིན་ཅི་ལོག་གི་འདུ་ཤེས་ཀྱི་རྩ་བ་གང་།
en: What is the root of the false concept?

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་གནས་པར་བྱའོ།
en: He should stand in equanimity toward all living beings.

source: ཉོན་མོངས་པ་ལས་རབ་ཏུ་ཐར་བར་བྱའོ།
en: He should liberate them from their afflictions.

source: ཚུལ་བཞིན་རབ་ཏུ་སྦྱར་བར་བྱའོ
en: He should apply himself appropriately.

source: ཇི་ལྟ་བུར་རབ་ཏུ་སྦྱར་ན། ཚུལ་བཞིན་དུ་རབ་ཏུ་སྦྱོར་བ་ཡིན།
en: How should he apply himself, to “apply himself appropriately”?

source: སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་ལ་རབ་ཏུ་སྦྱོར་བ་ནི་ཚུལ་བཞིན་དུ། རབ་ཏུ་སྦྱོར་བ་ཡིན་ནོ།
en: He should apply himself to productionlessness and to destructionlessness.

source: ཅི་མི་སྐྱེད། ཅི་མི་འགོག
en: What is not produced? And what is not destroyed?

source: མི་དགེ་བ་རྣམས་མི་སྐྱེད་ཅིང་། དགེ་བ་རྣམས་མི་འགོག་གོ།
en: Evil is not produced and good is not destroyed.

source: དགེ་བ་དང་མི་དགེ་བའི་རྩ་བ་གང་།
en: What is the root of good and evil?

source: འཇིག་ཚོགས་ནི་རྩ་བའོ།
en: Materiality is the root of good and evil.

source: འཇིག་ཚོགས་ཀྱི་རྩ་བ་གང་།
en: What is the root of materiality?

source: འཇིག་ཚོགས་ཀྱི་རྩ་བ་ནི་འདོད་པ་དང་ཆགས་པའོ།
en: Desire is the root of materiality.

source: འདོད་པ་དང་ཆགས་པའི་རྩ་བ་གང་།
en: What is the root of desire and attachment?

source: འདོད་པ་དང་ཆགས་པའི་རྩ་བ་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་རྟོག་པའོ།
en: Unreal construction is the root of desire.

source: ཡང་དག་པ་མ་ཡིན་པ་ཀུན་རྟོག་པའི་རྩ་བ་གང་།
en: What is the root of unreal construction?

source: རྩ་བ་ནི་ཕྱིན་ཅི་ལོག་གི་འདུ་ཤེས་སོ།
en: The false concept is its root.

source: ལྷ་མོ་མེ་ཏོག་འདི་དག་ནི་རུང་བ་མ་ཡིན་པས་ན་བདག་མེ་ཏོག་འདི་དག་འདོར་རོ།
en: Goddess, these flowers are not proper for religious persons and so we are trying to shake them off.

source: མེ་ཏོག་འདི་དག་ནི་རུང་བ་ཡིན་ནོ།
en: These flowers are proper indeed!

source: འདི་ལྟར་མེ་ཏོག་དེ་དག་ནི་མི་རྟོག །རྣམ་པར་མི་རྟོག་པ་སྟེ།
en: Such flowers have neither constructual thought nor discrimination.

source: གནས་བརྟན་ཤཱ་རིའི་བུ་ཉིད་རྟོག་ཅིང་རྣམ་པར་རྟོག་གོ།
en: But the elder Śāriputra has both constructual thought and discrimination.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་འདི་ལྟར་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་སྤངས་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་གི་ལུས་ལ་མེ་ཏོག་མི་ཆགས་པ་ལ་ལྟོས་
en: Reverend Śāriputra, see how these flowers do not stick to the bodies of these great spiritual heroes, the bodhisattvas! This is because they have eliminated constructual thoughts and discriminations.

source: དཔེར་ན་འཇིགས་པའི་རང་བཞིན་ཅན་གྱི་མི་ལ་ནི་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་གླགས་རྙེད་དོ།
en: In the same way that evil spirits have power over fearful men

source: །དེ་བཞིན་དུ་འཁོར་བའི་འཇིགས་པས་སྐྲག་པ་རྣམས་ལ་ནི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱས་གླགས་རྙེད་པར་འགྱུར་རོ། །གང་དག་འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་འཇིགས་པ་དང་བྲལ་བ་དེ་དག་ལ་ནི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱས་ཅི་ཞིག་བྱར་ཡོད།
en: those intimidated by fear of the world are in the power of forms, sounds, smells, tastes, and textures, which do not disturb those who are free from fear of the passions inherent in the constructive world.

source: གནས་བརྟན་གྱིས་རྣམ་པར་གྲོལ་བ་ལ་ཞུགས་ནས་ཡུན་ཇི་སྲིད་པའོ།
en: I have been here as long as the elder has been in liberation.

source: ལྷ་མོ་ཁྱོད་ཁྱིམ་འདིར་གནས་ནས་རིང་པོ་མ་ལོན་པ་ལྟ་ཞིག
en: Then, have you been in this house for quite some time?

source: གནས་བརྟན་གྱིས་རྣམ་པར་གྲོལ་བ་ལ་ཞུགས་ནས་ཇི་སྲིད་ལོན།
en: Has the elder been in liberation for quite some time?

source: གནས་བརྟན་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པའི་མཆོག་ནི་ཅིའི་ཕྱིར་མི་སྨྲ་ཞིང་།
en: Elder, you are ‘foremost of the wise!’ Why do you not speak?

source: ལྷ་མོ་རྣམ་པར་གྲོལ་བ་ནི་བརྗོད་དུ་མེད་ན་དེ་ཇི་སྐད་དུ་བརྗོད་མི་ཤེས་སོ།
en: Since liberation is inexpressible, goddess, I do not know what to say.

source: གནས་བརྟན་གྱིས་གང་ཡི་གེར་བརྗོད་པ་དེ་ཐམས་ཅད་ཀྱང་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དོ།
en: All the syllables pronounced by the elder have the nature of liberation.

source: རྣམ་པར་གྲོལ་བ་གང་ཡིན་པ་དེ་ནི་ནང་ནའང་མེད། ཕྱི་རོལ་ནའང་མེད། གཉི་ག་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Liberation is neither internal nor external, nor can it be apprehended apart from them.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ནི་འཕགས་པའི་རྣམ་པར་གྲོལ་བ་ཡིན་པའི་ཕྱིར་རོ།
en: The holy liberation is the equality of all things!

source: ལྷ་མོ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བའི་ཕྱིར་རྣམ་པར་གྲོལ་བ་མ་ཡིན་ནམ།
en: Goddess, is not liberation the freedom from desire, hatred, and folly?

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བས་རྣམ་པར་གྲོལ་བའོ་ཞེས་བྱ་བ་འདི་ནི་མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ལ་བསྟན་པ་སྟེ།
en: “Liberation is freedom from desire, hatred, and folly”—that is the teaching for the excessively proud.

source: །ལེགས་སོ་ལེགས་སོ། །ལྷ་མོ་ཁྱོད་ཀྱིས་ཅི་ཐོབ་ཅིང་ཅི་ལ་མངོན་དུ་བྱས་ནས་ཁྱོད་དེ་ལྟ་བུའི་སྤོབས་པ་དང་ལྡན།
en: Excellent! Excellent, goddess! Pray, what have you attained, what have you realized, that you have such eloquence?

source: བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གིས་ནི་ཅིའང་ཐོབ་པའང་མེད།
en: I have attained nothing, reverend Śāriputra.

source: ལྷ་མོ་ཁྱོད་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། ཐེག་པ་ཆེན་པོ་པའམ།
en: Goddess, do you belong to the disciple vehicle, to the solitary sage vehicle, or to the great vehicle?

source: བདག་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་སྟོན་པས་ན་ཉན་ཐོས་ཀྱི་ཐེག་པ་ཅན་ནོ།
en: I belong to the disciple vehicle when I teach it to those who need it.

source: །བདག་ནི་སྙིང་རྗེ་ཆེན་པོ་མི་གཏོང་བས་ན་ཐེག་པ་ཆེན་པོ་པ་ཡིན་མོད་ཀྱི་
en: And, since I never abandon the great compassion, I belong to the great vehicle,

source: འོན་ཀྱང་བཙུན་པ་ཤཱ་རིའི་བུ་དཔེར་ན་ཙམ་པ་ཀའི་ཚལ་དུ་ཞུགས་ན་ཨེ་རན་ཏའི་དྲི་ལ་མི་སྣོམ་གྱི། ཙམ་པ་ཀའི་ཚལ་དུ་ཞུགས་ན་ཙམ་པ་ཀ་ཉིད་ཀྱི་དྲི་ལ་སྣོམ་པ་
en: Nevertheless, reverend Śāriputra, just as one cannot smell the castor plant in a magnolia wood, but only the magnolia flowers,

source: དེ་བཞིན་དུ་བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདི་ན་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཡོན་ཏན་དྲི་དང་ལྡན་པ་གནས་པས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་དྲི་ལ་མི་སྣོམ་མོ།
en: so, reverend Śāriputra, living in this house, which is redolent with the perfume of the virtues of the buddha qualities, one does not smell the perfume of the disciples and the solitary sages.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདིར་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་དག་ཁྱིམ་འདིར་གནས་པ་དེ་དག་ཀྱང་
en: Reverend Śāriputra, the Śakras, the Brahmās, the Lokapālas, the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas who live in this house

source: སྐྱེས་བུ་དམ་པ་འདིའི་ཆོས་ཐོས་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཡོན་ཏན་གྱི་དྲིས་བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་དེ་དོང་ངོ་།
en: hear the Dharma from the mouth of this holy man and, enticed by the perfume of the virtues of the buddha qualities, proceed to conceive the spirit of enlightenment.

source: །གཞན་ཡང་བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདི་ན་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཆོས་བསྒྲགས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་ལྡན་པའི་གཏམ་དང་། ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོའི་གཏམ་དང་མི་འབྲལ་ཏེ།
en: Furthermore, reverend Śāriputra, this house is never empty of the sounds of the Dharma, the discourse on the six transcendences, and the discourses of the irreversible wheel of the Dharma.

source: །གཞན་ཡང་བཙུན་པ་ཤཱ་རིའི་བུ་ཁྱིམ་འདི་ན་རྟག་ཏུ་ལྷ་དང་། མིའི་རྔ་དང་། གླུའི་དབྱངས་དང་། རོལ་མོ་བྱེད་དེ། རྔ་དེ་དག་ལས་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་བསྒྲུབ་པའི་སྒྲ་དུས་ཐམས་ཅད་དུ་འབྱུང་སྟེ།
en: Furthermore, reverend Śāriputra, in this house one always hears the rhythms, songs, and music of gods and men, and from this music constantly resounds the sound of the infinite Dharma of the Buddha.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་ཁྱིམ་འདི་ན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་གང་བ་ཟད་མི་ཤེས་པའི་གཏེར་ཆེན་པོ་བཞི་ཡོད་དེ།
en: Furthermore, reverend Śāriputra, in this house there are always four inexhaustible treasures, replete with all kinds of jewels,

source: དེའི་མཐུས་སེམས་ཅན་དབུལ་ཞིང་ཕོངས་པ་ཐམས་ཅད་ཀྱིས་ཁྱེར་ཏེ་དོང་ཡང་ཟད་མི་ཤེས་ཏེ།
en: which never decrease, although all the poor and wretched may partake of them to their satisfaction.

source: ལྷ་མོ་ཁྱོད་བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ན་ཅི་ཉེས།
en: Goddess, what prevents you from transforming yourself out of your female state?

source: བདག་གི་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་བུད་མེད་ཀྱི་དངོས་པོ་བཙལ་ནའང་ད་དུང་མ་རྙེད་དོ།
en: Although I have sought my “female state” for these twelve years, I have not yet found it.

source: དེ་ལ་ཡང་དག་པ་ཡོངས་སུ་གྲུབ་པ་གང་ཡང་མེད་དོ།
en: No! Such a woman would not really exist, so what would there be to transform?

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མ་གྲུབ་པ་སྟེ།
en: Just so, reverend Śāriputra, all things do not really exist.

source: དེ་ནས་ལྷ་མོ་དེས་འདི་ལྟ་བུར་བྱིན་གྱི་བརླབ་པས་བྱིན་གྱིས་བརླབས་ནས་ཇི་ལྟ་བུར་གནས་བརྟན་ཤཱ་རིའི་བུ་ལྷ་མོ་དེ་ཅི་འདྲ་བ་དེ་འདྲ་བར་སྣང་སྟེ། ལྷ་མོ་དེ་ཡང་གནས་བརྟན་ཤཱ་རིའི་བུ་ཅི་འདྲ་བ་དེ་འདྲ་བར་སྣང་ངོ་།
en: Thereupon, the goddess employed her magical power to cause the elder Śāriputra to appear in her form and to cause herself to appear in his form.

source: །དེ་ནས་ལྷ་མོ་ཤཱ་རིའི་བུའི་གཟུགས་སུ་གྱུར་པ་དེས་ཤཱ་རིའི་བུ་ལྷ་མོའི་གཟུགས་སུ་གྱུར་པ་དེ་ལ་
en: Then the goddess, transformed into Śāriputra, said to Śāriputra, transformed into a goddess,

source: འདི་ལྟར་བཙུན་པ་ཤཱ་རིའི་བུ་བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ན་ཅི་ཉེས་ཞེས་དྲིས་སོ།
en: Reverend Śāriputra, what prevents you from transforming yourself out of your female state?

source: གལ་ཏེ་གནས་བརྟན་གྱིས་བུད་མེད་ཀྱི་གཟུགས་ལས་སླར་བསྒྱུར་ནུས་ན་ནི་བུད་མེད་ཐམས་ཅད་ཀྱང་བུད་མེད་ཀྱི་དངོས་པོ་ལས་འགྱུར་རོ།
en: If the elder could again change out of the female state, then all women could also change out of their female states.

source: བདག་གིས་བྱས་པའང་མེད་བསྒྱུར་བའང་མེད་དོ།
en: I neither made it nor did I change it.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་བྱས་པའང་མེད། བསྒྱུར་བའང་མེད་དོ། །གང་མ་བྱས་ཤིང་བསྒྱུར་བ་མེད་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་བཀའོ།
en: Just so, all things are neither made nor changed, and that they are not made and not changed, that is the teaching of the Buddha.

source: ལྷ་མོ་ཁྱོད་འདི་ནས་ཤི་འཕོས་ནས་གང་དུ་སྐྱེ་སྨྲས་པ།
en: Goddess, where will you be born when you transmigrate after death?

source: དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་དེ་གར་སྐྱེ་བར་བདག་ཀྱང་དེར་སྐྱེའོ།
en: I will be born where all the magical incarnations of the Tathāgata are born.

source: དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པ་ལ་ནི་འཆི་འཕོ་བ་ཡང་མེད། སྐྱེ་བ་ཡང་མེད་དོ།
en: But the emanated incarnations of the Tathāgata do not transmigrate nor are they born.

source: ཆོས་ཐམས་ཅད་ཀྱང་དེ་བཞིན་ཏེ། འཆི་འཕོ་མེད་ཅིང་སྐྱེ་བ་མེད་དོ།
en: All things and living beings are just the same; they do not transmigrate nor are they born!

source: ལྷ་མོ་ཁྱོད་ཅི་སྲིད་ན་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: Goddess, how soon will you attain the perfect enlightenment of buddhahood?

source: གང་གི་ཚེ་གནས་བརྟན་ཁྱོད་སོ་སོའི་སྐྱེ་བོའི་ཆོས་དང་ལྡན་པར་འགྱུར་བ་དེའི་ཚེ་བདག་ཀྱང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: At such time as you, elder, become endowed once more with the qualities of an ordinary individual, then will I attain the perfect enlightenment of buddhahood.

source: ལྷ་མོ་ཁོ་བོ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་དང་ལྡན་པར་འགྱུར་བ་དེ་ནི་གནས་མ་ཡིན་ནོ།
en: Goddess, it is impossible that I should become endowed once more with the qualities of an ordinary individual.

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བདག་ཀྱང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ནི་གནས་མ་ཡིན་ནོ།
en: Just so, reverend Śāriputra, it is impossible that I should attain the perfect enlightenment of buddhahood!

source: བྱང་ཆུབ་ནི་གནས་མ་ཡིན་པ་ལ་གནས་པའི་ཕྱིར་ཏེ། དེ་ལྟ་བས་ན་གནས་མ་ཡིན་པ་ལ་ནི་སུ་ཡང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མེད་དོ།
en: Because perfect enlightenment stands upon the impossible. Because it is impossible, no one attains the perfect enlightenment of buddhahood.

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པ་ནི་
en: But the Tathāgata has declared:

source: གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: The tathāgatas, who are as numerous as the sands of the Ganges, have attained perfect buddhahood,

source: བཙུན་པ་ཤཱ་རིའི་བུ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་རྣམས་ཞེས་བྱ་བ་དེ་ནི་ཡི་གེ་བགྲང་བའི་བརྡའི་ཚིག་བླ་དགས་ཏེ།
en: Reverend Śāriputra, the expression “the buddhas of the past, present, and future” is a conventional expression made up of a certain number of syllables.

source: ཐོབ་པ་མེད་པའི་རྒྱུས་ཐོབ་བོ།
en: It is attained, because there is no attainment.

source: དེ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་མེད་པའི་རྒྱུས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བོ།
en: Just so, there is perfect enlightenment because there is no attainment of perfect enlightenment.

source: ཕྱིར་མི་ལྡོག་པ་ལ་ཡང་དག་པར་ཞུགས་པ་སྟེ།
en: She has actually attained irreversibility.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་གྱི་དབང་གིས་ཇི་ལྟར་འདོད་པ་དེ་བཞིན་དུ་གནས་སོ།
en: She can live wherever she wishes on the strength of her vow to develop living beings.

source: །།དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then, the crown prince Mañjuśrī asked the Licchavi Vimalakīrti,

source: འཇམ་དཔལ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་འགྲོ་བར་སོང་བ་ཡིན་ནོ།
en: Mañjuśrī, when the bodhisattva follows the wrong way, he follows the way to attain the qualities of the Buddha.

source: བྱང་ཆུབ་སེམས་དཔའི་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་གང་།
en: How does the bodhisattva follow the wrong way?

source: གང་གི་ཚེ་མཚམས་མེད་པ་ལྔའི་འགྲོ་བར་འགྲོ་ཡང་གནོད་སེམས་དང་། རྣམ་པར་འཚེ་བ་དང་། རབ་ཏུ་སྡང་བར་མི་འགྱུར་རོ།
en: Even should he enact the five deadly sins, he feels no malice, violence, or hate.

source: །སེམས་ཅན་དམྱལ་བའི་འགྲོ་བར་འགྲོ་ཡང་ཉོན་མོངས་པའི་རྡུལ་ཐམས་ཅད་དང་བྲལ་བ་ཡིན།
en: Even should he go into the hells, he remains free of all taint of afflictions.

source: མྱ་ངན་ལས་འདས་པའི་འགྲོ་བར་འགྲོ་ཡང་འཁོར་བའི་རྒྱུན་ཀྱང་མི་གཏོང་བ་ཡིན་ཏེ་
en: He follows the way of liberation without ever abandoning the progress of the world.

source: འཇམ་དཔལ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་སྟེ།
en: Mañjuśrī, thus does the bodhisattva follow the wrong ways,

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རིགས་ནི་གང་ཡིན།
en: Mañjuśrī, what is the ‘family of the tathāgatas’?
